



LSR Working Group                                                 X. Min
Internet-Draft                                                  Z. Zhang
Intended status: Standards Track                               ZTE Corp.
Expires: August 25, 2021                                        W. Cheng
                                                            China Mobile
                                                       February 21, 2021


  Signaling Flow-ID Label Capability and Flow-ID Readable Label Depth
                          Using IGP and BGP-LS
                     draft-xzc-lsr-mpls-flc-flrd-00

Abstract

   Flow-ID Label (FL) is used for MPLS flow identification and flow-
   based performance measurement with alternate marking method.  The
   ability to process Flow-ID labels is called Flow-ID Label Capability
   (FLC), and the capability of reading the maximum label stack depth
   and performing FL-based performance measurement is called Flow-ID
   Readable Label Depth (FRLD).  This document defines a mechanism to
   signal the FLC and the FRLD using IGP and BGP-LS.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on August 25, 2021.

Copyright Notice

   Copyright (c) 2021 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents



Min, et al.              Expires August 25, 2021                [Page 1]

Internet-Draft Signaling FLC and FLRD using IGP and BGP-LS February 2021


   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Advertising FLC Using IGP . . . . . . . . . . . . . . . . . .   3
     2.1.  Advertising FLC Using IS-IS . . . . . . . . . . . . . . .   3
     2.2.  Advertising FLC Using OSPFv2  . . . . . . . . . . . . . .   3
     2.3.  Advertising FLC Using OSPFv3  . . . . . . . . . . . . . .   4
   3.  Advertising FRLD Using IGP  . . . . . . . . . . . . . . . . .   4
   4.  Signaling FLC and FRLD in BGP-LS  . . . . . . . . . . . . . .   4
   5.  Security Considerations . . . . . . . . . . . . . . . . . . .   5
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   5
   7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   5
   8.  Normative References  . . . . . . . . . . . . . . . . . . . .   5
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   7

1.  Introduction

   As specified in [I-D.ietf-mpls-inband-pm-encapsulation], Flow-ID
   Label (FL) is used for MPLS flow identification and flow-based
   performance measurement with alternate marking method.

   Flow-ID Label may appear multiple times in a label stack with
   variable depth, so both the Flow-ID Label Capability (FLC) and the
   Flow-ID Readable Label Depth (FRLD) are defined in
   [I-D.ietf-mpls-inband-pm-encapsulation].

   Analogous to [I-D.ietf-isis-mpls-elc] and [I-D.ietf-ospf-mpls-elc],
   this document defines a mechanism to signal the FLC and the FRLD
   using IGP and BGP-LS, specifically, IGP includes IS-IS, OSPFv2 and
   OSPFv3.

1.1.  Terminology

   This memo makes use of the terms defined in
   [I-D.ietf-mpls-inband-pm-encapsulation] and [RFC8491].

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.



Min, et al.              Expires August 25, 2021                [Page 2]

Internet-Draft Signaling FLC and FLRD using IGP and BGP-LS February 2021


2.  Advertising FLC Using IGP

   Even though FLC is a property of the node, in some cases it is
   advantageous to associate and advertise the FLC with a prefix, so FLC
   is advertised with a prefix in this document.

   If a router has multiple interfaces, the router MUST NOT announce FLC
   unless all of its interfaces are capable of processing FLs.

   If the router supports FLs on all of its interfaces, it SHOULD
   advertise the FLC with every local host prefix it advertises in IGP.

2.1.  Advertising FLC Using IS-IS

   Next to the ELC Flag (E-flag) defined in Section 3 of
   [I-D.ietf-isis-mpls-elc], a new bit FLC Flag (F-flag) is defined,
   which is Bit 4 in the Prefix Attribute Flags [RFC7794], as shown in
   Figure 1.


                             0 1 2 3 4 5 6 7...
                            +-+-+-+-+-+-+-+-+...
                            |X|R|N|E|F|      ...
                            +-+-+-+-+-+-+-+-+...


                     Figure 1: Prefix Attribute Flags

   F-Flag: FLC Flag (Bit 4)

      Set for local host prefix of the originating node if it supports
      FLC on all interfaces.

   The FLC signaling MUST be preserved when a router propagates a prefix
   between ISIS levels [RFC5302].

2.2.  Advertising FLC Using OSPFv2

   Next to the ELC Flag (E-flag) defined in Section 3.1 of
   [I-D.ietf-ospf-mpls-elc], a new bit FLC Flag (F-flag) is defined,
   which is Bit 3 in Flags field of OSPFv2 Extended Prefix TLV
   [RFC7684]:

      0x10 - F-Flag (FLC Flag): Set for local host prefix of the
      originating node if it supports FLC on all interfaces.

   The FLC signaling MUST be preserved when an OSPFv2 Area Border Router
   (ABR) distributes information between areas.  To do so, an ABR MUST



Min, et al.              Expires August 25, 2021                [Page 3]

Internet-Draft Signaling FLC and FLRD using IGP and BGP-LS February 2021


   originate an OSPFv2 Extended Prefix Opaque LSA [RFC7684] including
   the received FLC setting.

2.3.  Advertising FLC Using OSPFv3

   Next to the ELC Flag (E-flag) defined in Section 3.2 of
   [I-D.ietf-ospf-mpls-elc], a new bit FLC Flag (F-flag) is defined,
   which is Bit 0 in OSPFv3 PrefixOptions field [RFC5340]:

      0x80 - F-Flag (FLC Flag): Set for local host prefix of the
      originating node if it supports FLC on all interfaces.

   The FLC signaling MUST be preserved when an OSPFv3 Area Border Router
   (ABR) distributes information between areas.  The setting of the FLC
   Flag in the Inter-Area-Prefix-LSA [RFC5340] or in the Inter-Area-
   Prefix TLV [RFC8362], generated by an ABR, MUST be the same as the
   value the FLC Flag associated with the prefix in the source area.

3.  Advertising FRLD Using IGP

   As requested by [RFC8491], IANA has created an IANA-managed registry
   titled "IGP MSD-Types" to identify MSD-Types.  A new MSD-Type, called
   FRLD-MSD, is defined to advertise the FRLD of a given router.  The
   MSD-Type code 3 is requested to be assigned by IANA for FRLD-MSD.
   The MSD-Value field is set to the FRLD in the range between 0 to 255.

   If a router has multiple interfaces with different capabilities of
   reading the maximum label stack depth, the router MUST advertise the
   smallest value found across all of its interfaces.

   For IS-IS, the FRLD is advertised in a Node MSD Sub-TLV [RFC8491]
   using the FRLD-MSD type.

   For OSPF including both OSPFv2 and OSPFv3, the FRLD is advertised in
   a Node MSD TLV [RFC8476] using the FRLD-MSD type.

   The absence of FRLD-MSD advertisements indicates only that the
   advertising node does not support advertisement of this capability.

4.  Signaling FLC and FRLD in BGP-LS

   The IGP extensions defined in this document can be advertised via
   BGP-LS (Distribution of Link-State and TE Information Using BGP)
   [RFC7752] using existing BGP-LS TLVs.

   The FLC is advertised using the Prefix Attribute Flags TLV as defined
   in [I-D.ietf-idr-bgp-ls-segment-routing-ext].




Min, et al.              Expires August 25, 2021                [Page 4]

Internet-Draft Signaling FLC and FLRD using IGP and BGP-LS February 2021


   The FRLD-MSD is advertised using the Node MSD TLV as defined in
   [RFC8814].

5.  Security Considerations

   This document does not raise any additional security issues beyond
   those of the specifications referred to in the list of normative
   references.

6.  IANA Considerations

   This document requests the following allocations from IANA:

      - Bit 4 in the Bit Values for Prefix Attribute Flags Sub-TLV
      registry is requested to be assigned to the FLC Flag (F-Flag).

      - Flag 0x10 in the OSPFv2 Extended Prefix TLV Flags registry is
      requested to be assigned to the FLC Flag (F-Flag).

      - Bit 0x80 in the "OSPFv3 Prefix Options (8 bits)" registry is
      requested to be assigned to the FLC Flag (F-Flag).

      - Type 3 in the IGP MSD-Types registry is requested to be assigned
      to the FRLD-MSD.

7.  Acknowledgements

   TBA.

8.  Normative References

   [I-D.ietf-idr-bgp-ls-segment-routing-ext]
              Previdi, S., Talaulikar, K., Filsfils, C., Gredler, H.,
              and M. Chen, "BGP Link-State extensions for Segment
              Routing", draft-ietf-idr-bgp-ls-segment-routing-ext-16
              (work in progress), June 2019.

   [I-D.ietf-isis-mpls-elc]
              Xu, X., Kini, S., Psenak, P., Filsfils, C., Litkowski, S.,
              and M. Bocci, "Signaling Entropy Label Capability and
              Entropy Readable Label Depth Using IS-IS", draft-ietf-
              isis-mpls-elc-13 (work in progress), May 2020.

   [I-D.ietf-mpls-inband-pm-encapsulation]
              Cheng, W., Min, X., Zhou, T., Dong, X., and Y. Peleg,
              "Encapsulation For MPLS Performance Measurement with
              Alternate Marking Method", draft-ietf-mpls-inband-pm-
              encapsulation-00 (work in progress), January 2021.



Min, et al.              Expires August 25, 2021                [Page 5]

Internet-Draft Signaling FLC and FLRD using IGP and BGP-LS February 2021


   [I-D.ietf-ospf-mpls-elc]
              Xu, X., Kini, S., Psenak, P., Filsfils, C., Litkowski, S.,
              and M. Bocci, "Signaling Entropy Label Capability and
              Entropy Readable Label Depth Using OSPF", draft-ietf-ospf-
              mpls-elc-15 (work in progress), June 2020.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC5302]  Li, T., Smit, H., and T. Przygienda, "Domain-Wide Prefix
              Distribution with Two-Level IS-IS", RFC 5302,
              DOI 10.17487/RFC5302, October 2008,
              <https://www.rfc-editor.org/info/rfc5302>.

   [RFC5340]  Coltun, R., Ferguson, D., Moy, J., and A. Lindem, "OSPF
              for IPv6", RFC 5340, DOI 10.17487/RFC5340, July 2008,
              <https://www.rfc-editor.org/info/rfc5340>.

   [RFC7684]  Psenak, P., Gredler, H., Shakir, R., Henderickx, W.,
              Tantsura, J., and A. Lindem, "OSPFv2 Prefix/Link Attribute
              Advertisement", RFC 7684, DOI 10.17487/RFC7684, November
              2015, <https://www.rfc-editor.org/info/rfc7684>.

   [RFC7752]  Gredler, H., Ed., Medved, J., Previdi, S., Farrel, A., and
              S. Ray, "North-Bound Distribution of Link-State and
              Traffic Engineering (TE) Information Using BGP", RFC 7752,
              DOI 10.17487/RFC7752, March 2016,
              <https://www.rfc-editor.org/info/rfc7752>.

   [RFC7794]  Ginsberg, L., Ed., Decraene, B., Previdi, S., Xu, X., and
              U. Chunduri, "IS-IS Prefix Attributes for Extended IPv4
              and IPv6 Reachability", RFC 7794, DOI 10.17487/RFC7794,
              March 2016, <https://www.rfc-editor.org/info/rfc7794>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8362]  Lindem, A., Roy, A., Goethals, D., Reddy Vallem, V., and
              F. Baker, "OSPFv3 Link State Advertisement (LSA)
              Extensibility", RFC 8362, DOI 10.17487/RFC8362, April
              2018, <https://www.rfc-editor.org/info/rfc8362>.







Min, et al.              Expires August 25, 2021                [Page 6]

Internet-Draft Signaling FLC and FLRD using IGP and BGP-LS February 2021


   [RFC8476]  Tantsura, J., Chunduri, U., Aldrin, S., and P. Psenak,
              "Signaling Maximum SID Depth (MSD) Using OSPF", RFC 8476,
              DOI 10.17487/RFC8476, December 2018,
              <https://www.rfc-editor.org/info/rfc8476>.

   [RFC8491]  Tantsura, J., Chunduri, U., Aldrin, S., and L. Ginsberg,
              "Signaling Maximum SID Depth (MSD) Using IS-IS", RFC 8491,
              DOI 10.17487/RFC8491, November 2018,
              <https://www.rfc-editor.org/info/rfc8491>.

   [RFC8814]  Tantsura, J., Chunduri, U., Talaulikar, K., Mirsky, G.,
              and N. Triantafillis, "Signaling Maximum SID Depth (MSD)
              Using the Border Gateway Protocol - Link State", RFC 8814,
              DOI 10.17487/RFC8814, August 2020,
              <https://www.rfc-editor.org/info/rfc8814>.

Authors' Addresses

   Xiao Min
   ZTE Corp.
   Nanjing
   China

   Email: xiao.min2@zte.com.cn


   Zheng(Sandy) Zhang
   ZTE Corp.
   Nanjing
   China

   Email: zhang.zheng@zte.com.cn


   Weiqiang Cheng
   China Mobile
   Beijing
   China

   Email: chengweiqiang@chinamobile.com











Min, et al.              Expires August 25, 2021                [Page 7]
